/*
Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение наибольшего элемента последовательности.
Формат входных данных
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
Формат выходных данных
Выведите ответ на задачу.

Sample Input:

1
7
9
0

Sample Output:

9
*/

#include <iostream>

int main() {
    int n = 0, mx = -1;
    while(true) {
        std::cin >> n;
        if(n) {
            mx = std::max(mx, n);
        }
        else {
            break;
        }
    }
    
    std::cout << mx;
    return 0;
}